
const v = '0.0.39';

/*
0.0.1
строка версии на карте (food map v.X)
версионность модулей зависит от общей версии
динамическая загрузка входного скрипта  - customer.entry.js
установки слайдера диапозона цен в мп
замена иконки цены в мп  - fa-coins
уменьшение размера картинок товаров в магазине - padding 15
0.0.2
окно гео-контекстной карусели
0.0.3
окно гео-контекстной карусели - скидки
0.0.4
окно мп - по умолчению в свернутом виде, развертывается через клик иконки или элементов вкладки меню
окно мп - открытиктие/закрытие описания товара только через клик иконки
линейное позиционирование элементов управления по верхней границы экрана
окно календаря сдвинуто к левой границе экрана

0.0.7
единый вход в приложение покупателя
позиционирование выбранного товара в окне магазина по клику в каруселе
поиск адреса доставки в окне службы доставки; маркер в центре экрана; фокусировка поля ввода адреса после поиска
скидки  в окне магазина
фиксированная высота карточки товара
баг открытия календаря
окно мп - сортировка цен
мп - баг с появлением значка описания товара
адаптация под Safari

0.0.9
мп - сохранение заказа; индикация количества заказов в категории

0.0.11
индикация кол-ва заказов, подтвержденных заказов
мп - раздельная загрузка самовывоз/доставка
мп - убран titlebar

0.0.13
оформление заказа в корзине
индикация ожидания подтверждения заказа
деактивация кнопок вызова мп при отстутствии предложений
баг поиска адреса доставки
подписи кнопок в корзине

0.0.17
профиль - удален портрет пользователя; исправлен баг сохранения адреса
корзина - совмещение колонок время и адрес доставки; комменты заказа(идея  - переделать в чат);
          совмещение колонок название поставщика и адреса магазина;
мп - баг в отображении поиска адреса;

0.0.30
доставка  - обновленный интерефейс, привязка к ценам поставщика


0.0.36
текущее положение пользователя на карте обозначается анимированным колоботом;
расчет стоимости доставки в зависимости от удаленности

0.0.39
webpack 5

 */